stevew817/DAPLink/source/common/hal/siliconlabs/efm32hg/usbd_EFM32HG.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2015 ARM Ltd.
 *
 * This software is provided 'as-is', without any express or implied warranty.
 * In no event will the authors be held liable for any damages arising from
 * the use of this software. Permission is granted to anyone to use this
 * software for any purpose, including commercial applications, and to alter
 * it and redistribute it freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software in
 *    a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 *
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 *
 * 3. This notice may not be removed or altered from any source distribution.
 *
 * -------------------------------------------------------------------------- */
 
 /* -----------------------------------------------------------------------------
 * Backported by Silicon Labs to CMSIS Driver v1 interface, in order to
 * support the DAPLink USB interface.
 * -------------------------------------------------------------------------- */

/* NOTE:
 *  Isochronous Endpoints are not supported
 */

#include <RTL.h>
#include <rl_usb.h>
#include <em_device.h> 
#include "em_gpio.h"
#include "em_cmu.h"
#include "em_int.h"
#define USB_VBUS_SWITCH_NOT_PRESENT

#define __NO_USB_LIB_C
#include "usb_config.c"

#define USBD_MAX_ENDPOINT_NUM           3U

#define RX_FIFO_SIZE        512
#define TX0_FIFO_SIZE       128
#define TX1_FIFO_SIZE       128
#define TX2_FIFO_SIZE       128
#define TX3_FIFO_SIZE       128

#define TX_FIFO(n)          *((volatile uint32_t *)(USB->FIFO0D + (n * 1024U)))
#define RX_FIFO             *((volatile uint32_t *)(USB->FIFO0D))

#define DIEPTSIZ(ep_num)    *((volatile uint32_t *)(&USB->DIEP0TSIZ   + (ep_num * 8U)))
#define DIEPCTL(ep_num)     *((volatile uint32_t *)(&USB->DIEP0CTL    + (ep_num * 8U)))
#define DTXFSTS(ep_num)     *((volatile uint32_t *)(&USB->DIEP0TXFSTS + (ep_num * 8U)))
#define DOEPTSIZ(ep_num)    *((volatile uint32_t *)(&USB->DOEP0TSIZ   + (ep_num * 8U)))
#define DOEPCTL(ep_num)     *((volatile uint32_t *)(&USB->DOEP0CTL    + (ep_num * 8U)))
#define DIEPINT(ep_num)     *((volatile uint32_t *)(&USB->DIEP0INT    + (ep_num * 8U)))
#define DOEPINT(ep_num)     *((volatile uint32_t *)(&USB->DOEP0INT    + (ep_num * 8U)))

#define EP_IN_TYPE(num)      ((DIEPCTL(num) >> 18) & 3)
#define EP_OUT_TYPE(num)     ((DOEPCTL(num) >> 18) & 3)

uint32_t OutMaxPacketSize[4] = {USBD_MAX_PACKET0,0,0,0};

#if (USBD_HID_ENABLE == 1)
uint32_t HID_IntInPacketData     [(USBD_HID_MAX_PACKET + 3) / 4];
#endif
#if (USBD_MSC_ENABLE == 1)
uint32_t MSC_IntInPacketData     [(USBD_MSC_MAX_PACKET + 3) / 4];
#endif
#if (USBD_CDC_ACM_ENABLE == 1)
uint32_t CDC_ACM_IntInPacketData [(USBD_CDC_ACM_MAX_PACKET  + 3) / 4];
#endif

uint32_t *InPacketDataPtr[4] = { 0,
#if   ((USBD_HID_ENABLE     == 1) && (USBD_HID_EP_INTIN      == 1))
                       HID_IntInPacketData,
#elif ((USBD_CDC_ACM_ENABLE == 1) && (USBD_CDC_ACM_EP_INTIN  == 1))
                       CDC_ACM_IntInPacketData, 
#elif ((USBD_MSC_ENABLE     == 1) && (USBD_MSC_EP_INTIN      == 1))
                       MSC_IntInPacketData, 
#else
                            0, 
#endif

#if   ((USBD_HID_ENABLE     == 1) && (USBD_HID_EP_INTIN      == 2))
                       HID_IntInPacketData, 
#elif ((USBD_CDC_ACM_ENABLE == 1) && (USBD_CDC_ACM_EP_INTIN  == 2))
                       CDC_ACM_IntInPacketData, 
#elif ((USBD_MSC_ENABLE     == 1) && (USBD_MSC_EP_INTIN      == 2))
                       MSC_IntInPacketData, 
#else
                            0, 
#endif

#if   ((USBD_HID_ENABLE     == 1) && (USBD_HID_EP_INTIN      == 3))
                       HID_IntInPacketData, 
#elif ((USBD_CDC_ACM_ENABLE == 1) && (USBD_CDC_ACM_EP_INTIN  == 3))
                       CDC_ACM_IntInPacketData, 
#elif ((USBD_MSC_ENABLE     == 1) && (USBD_MSC_EP_INTIN      == 3))
                       MSC_IntInPacketData, 
#else
                            0, 
#endif
};


#if    (USBD_ADC_ENABLE == 1)

uint32_t ADC_IsoOutPacketData    [(USBD_ADC_WMAXPACKETSIZE + 3) / 4];

uint32_t *IsoOutPacketDataPtr[4] = { 0,
#if    (USBD_ADC_EP_ISOOUT == 1)
                                     ADC_IsoOutPacketData,
#else
                                     0,
#endif
  
#if    (USBD_ADC_EP_ISOOUT == 2)
                                     ADC_IsoOutPacketData,
#else
                                     0,
#endif
  
#if    (USBD_ADC_EP_ISOOUT == 3)
                                     ADC_IsoOutPacketData,
#else
                                     0,
#endif
};
#else
uint32_t *IsoOutPacketDataPtr[4] = { 0 };
#endif


uint32_t InPacketDataCnt[4]      = { 0 };
uint32_t InPacketDataReady       =   0  ;
uint32_t SyncWriteEP             =   0  ;

uint32_t IsoOutPacketDataCnt[4]  = { 0 };
uint32_t IsoOutTokenRead         =   0  ;

/*
 *  generic_delay
 *    Parameters:      delay:      Delay in 100 us ticks
 *    Return Value:    None
 */
void generic_delay (uint32_t delay) {
  delay *= SystemCoreClock / 100000;
  while (delay--) {
    __nop(); __nop(); __nop(); __nop(); __nop(); __nop(); __nop(); __nop();
  }
}


/*
 *  USB Device Interrupt enable
 *   Called by USBD_Init to enable the USB Interrupt
 *    Return Value:    None
 */

#ifdef __RTX
void __svc(1) USBD_IntrEna (void);
void __SVC_1               (void) {
#else
void          USBD_IntrEna (void) {
#endif
  NVIC_EnableIRQ   (USB_IRQn);
}


/*
 *  USB Device Initialize Function
 *   Called by the User to initialize USB
 *   Return Value:    None
 */

void USBD_Init (void) {
  //Set up the clocks in the Happy Gecko
  //
  // * USHFRCO set to 48MHz and auto-calibrated to the USB line
  // * LFRCO drives the LF clock tree
  // * USHFRCO / 2 drives the core (core @ 24MHz)
  // * CoreCLK drives the peripheral clock (HFPERCLK @ 24MHz), needs to be as high as possible for GPIO
  
  CMU->USHFRCOCONF = CMU_USHFRCOCONF_BAND_48MHZ;
  CMU_OscillatorEnable(cmuOsc_USHFRCO, true, true);
  if ( CMU_ClockSelectGet( cmuClock_HF ) != cmuSelect_USHFRCODIV2 )
  {
    CMU_ClockSelectSet( cmuClock_HF, cmuSelect_USHFRCODIV2 );
  }
	
	//Enable clock to USB system part
	CMU_ClockEnable(cmuClock_USB, true);
	
	//Enable voltage sensing
	USB->CTRL |= USB_CTRL_VREGOSEN;
	
	//Enable PHY pins
	USB->ROUTE = USB_ROUTE_PHYPEN;
	
