stevew817/DAPLink/source/common/hal/siliconlabs/efm32hg/usbd_EFM32HG.c
	//Enable USHFRCO reference for USB core
	CMU_ClockEnable(cmuClock_USBC, true);
	CMU_ClockSelectSet(cmuClock_USBC, cmuSelect_USHFRCO);
	CMU_ClockEnable(cmuClock_USBC, true);
	

  CMU_ClockEnable(cmuClock_CORELE, true);
  /* LFC clock is needed to detect USB suspend when LEMIDLE is activated. */
  CMU_ClockSelectSet(cmuClock_LFC, cmuSelect_LFRCO);
	CMU_ClockEnable(cmuClock_USBLE, true);

  /* Enable USHFRCO Clock Recovery mode. */
  CMU->USBCRCTRL |= CMU_USBCRCTRL_EN;

  /* Turn on Low Energy Mode (LEM) features. */
  USB->CTRL = USB_CTRL_LEMOSCCTRL_GATE
              | USB_CTRL_LEMIDLEEN
              | USB_CTRL_LEMPHYCTRL;
							
	while ((USB->GRSTCTL & USB_GRSTCTL_AHBIDLE) == 0U);
  
  // Core soft reset
	USB->GRSTCTL  |=  USB_GRSTCTL_CSFTRST;
	while ((USB->GRSTCTL & USB_GRSTCTL_CSFTRST) != 0U);
	generic_delay (10);

	// Wait until AHB Master state machine is in the idle condition
	while ((USB->GRSTCTL & USB_GRSTCTL_AHBIDLE) == 0U);

	USBD_Reset ();                                    // Reset variables and endpoint settings
			
	// Program AHB config
	USB->GAHBCFG = USB_GAHBCFG_NPTXFEMPLVL | USB_GAHBCFG_GLBLINTRMSK;
	USB->GINTMSK = USB_GINTMSK_MODEMISMSK;
  
	// Clear SOF
	USB->GINTSTS = USB_GINTSTS_SOF;
	while((USB->GINTSTS & USB_GINTSTS_CURMOD)!= 0);
	
  generic_delay    (30);            // Wait 3ms

  USB->DCTL |= USB_DCTL_SFTDISCON;  // Soft disconnect enabled
	USB->DCFG |= USB_DCFG_DEVSPD_FS;  // Select Full-speed (48MHz)

  generic_delay    (1000);           // Wait 100ms

  USB->GINTMSK     = (USB_GINTMSK_USBSUSPMSK)  |      // suspend int unmask
										 //(USB_GINTMSK_ERLYSUSPMSK) |    // early suspend int unmask
                     (USB_GINTMSK_USBRSTMSK)   |      // reset int unmask
                     (USB_GINTMSK_ENUMDONEMSK) |      // enumeration done int unmask
                     (USB_GINTMSK_RXFLVLMSK)   |      // receive fifo non-empty int  unmask
                     (USB_GINTMSK_IEPINTMSK)   |      // IN EP int unmask
                     (USB_GINTMSK_OEPINTMSK)   |      // OUT EP int unmask
                     (USB_GINTMSK_WKUPINTMSK)  |      // resume int unmask
#ifdef __RTX
  ((USBD_RTX_DevTask   != 0) ? (USB_GINTMSK_SOFMSK) : 0);   // SOF int unmask
#else                            
  ((USBD_P_SOF_Event   != 0) ? (USB_GINTMSK_SOFMSK) : 0);   // SOF int unmask
#endif

  // Enable NVIC interrupt for USB
  USBD_IntrEna();

  // Enable interrupts and set TX FIFO interrupt level to EMPTY
  USB->GAHBCFG    |=  USB_GAHBCFG_GLBLINTRMSK | USB_GAHBCFG_NPTXFEMPLVL;
}


/*
 *  USB Device Connect Function
 *   Called by the User to Connect/Disconnect USB Device
 *    Parameters:      con:   Connect/Disconnect
 *    Return Value:    None
 */

void USBD_Connect (uint32_t con) {
  if (con) {
    USB->DCTL   &= ~USB_DCTL_SFTDISCON;          // soft disconnect disabled
  }
  else {
    USB->DCTL   |=  USB_DCTL_SFTDISCON;          // soft disconnect enabled
  }
}


/*
 *  USB Device Flush IN Endpoint Transmit Fifo
 *    Parameters:      adr:   USB Device Address
 *    Return Value:    None
 */
static void USBD_FlushInEpFifo (uint8_t ep_addr) {
	ep_addr &= ~0x80;
  if(ep_addr > USBD_MAX_ENDPOINT_NUM) return;
  USB->GRSTCTL = (USB->GRSTCTL & ~_USB_GRSTCTL_TXFNUM_MASK)         |
                 (((uint32_t)ep_addr) << _USB_GRSTCTL_TXFNUM_SHIFT) |
                  USB_GRSTCTL_TXFFLSH;
}


/*
 *  USB Device Reset Function
 *   Called automatically on USB Device Reset
 *    Return Value:    None
 */

void USBD_Reset (void) {
  uint32_t i;

  SyncWriteEP       = 0;
  InPacketDataReady = 0;
  USB->DOEPMSK      = 0;
  USB->DIEPMSK      = 0;  
  
  for (i = 1; i < (USBD_EP_NUM + 1); i++) {
    if ((DOEPCTL(i) & USB_DOEP_CTL_EPENA) != 0U) {
      DOEPCTL(i)   = USB_DOEP_CTL_EPDIS |       // Endpoint disable
                     USB_DOEP_CTL_SNAK;         // Endpoint set NAK
    }
    if ((DIEPCTL(i) & USB_DIEP_CTL_EPENA) != 0U) {
      DIEPCTL(i)   = USB_DIEP_CTL_EPDIS |       // Endpoint disable
                     USB_DIEP_CTL_SNAK;         // Endpoint set NAK
    }
    USBD_FlushInEpFifo(i);

    // Clear IN Endpoint interrupts
    DIEPINT(i) = USB_DIEP_INT_XFERCOMPL   |
								 USB_DIEP_INT_EPDISBLD    |
								 USB_DIEP_INT_INTKNTXFEMP |
								 USB_DIEP_INT_INEPNAKEFF  |
								 USB_DIEP_INT_TXFEMP      ;

    // Clear OUT Endpoint interrupts
    DOEPINT(i) = USB_DOEP_INT_XFERCOMPL   |
								 USB_DOEP_INT_EPDISBLD    |
								 USB_DOEP_INT_SETUP       |
								 USB_DOEP_INT_OUTTKNEPDIS ;
  }

	
  // Set device address to 0
  USB->DCFG       = (USB->DCFG & ~_USB_DCFG_DEVADDR_MASK);
  USB->DAINTMSK   =  USB_DAINTMSK_INEPMSK0    |     // Enable IN Endpoint0 interrupt
                     USB_DAINTMSK_OUTEPMSK0;        // Enable OUT Endpoint0 interrupt

  // Enable Setup phase done, OUT Endpoint disabled and OUT transfer complete interrupt
  USB->DOEPMSK    = USB_DOEPMSK_SETUPMSK      |
                    USB_DOEPMSK_XFERCOMPLMSK  ;

  // Enable In Endpoint disable and IN transfer complete interrupt
  USB->DIEPMSK    = USB_DIEPMSK_XFERCOMPLMSK;

  // Configure FIFOs
  USB->GRXFSIZ   =  RX_FIFO_SIZE / 4;
  USB->GNPTXFSIZ  = (RX_FIFO_SIZE/4) | ((TX0_FIFO_SIZE/4) << 16);

  USB->DIEPTXF1  = ((RX_FIFO_SIZE + TX0_FIFO_SIZE)/4) |
                   ((TX1_FIFO_SIZE/4) << 16);

  USB->DIEPTXF2  = ((RX_FIFO_SIZE + TX0_FIFO_SIZE + TX1_FIFO_SIZE)/4) |
                   ((TX2_FIFO_SIZE/4) << 16);

  USB->DIEPTXF3  = ((RX_FIFO_SIZE + TX0_FIFO_SIZE+ TX1_FIFO_SIZE +TX2_FIFO_SIZE)/4) |
                   ((TX3_FIFO_SIZE/4) << 16);

  USB->DOEP0TSIZ =  (3 << _USB_DOEP0TSIZ_SUPCNT_SHIFT) |  // setup count = 3
                    (USB_DOEP0TSIZ_PKTCNT) |              // packet count
                     USBD_MAX_PACKET0;
										 
	
}


/*
 *  USB Device Suspend Function
 *   Called automatically on USB Device Suspend
 *    Return Value:    None
 */

void USBD_Suspend (void) {
}


/*
 *  USB Device Resume Function
 *   Called automatically on USB Device Resume
 *    Return Value:    None
 */

void USBD_Resume (void) {
}


