stevew817/DAPLink/source/common/hal/siliconlabs/efm32hg/usbd_EFM32HG.c
/*
 *  USB Device Remote Wakeup Function
 *   Called automatically on USB Device Remote Wakeup
 *    Return Value:    None
 */

void USBD_WakeUp (void) {
  USB->DCTL |= USB_DCTL_RMTWKUPSIG;  // remote wakeup signaling
  generic_delay (50);                // Wait ~5 ms
  USB->DCTL &= ~USB_DCTL_RMTWKUPSIG;
}


/*
 *  USB Device Remote Wakeup Configuration Function
 *    Parameters:      cfg:   Device Enable/Disable
 *    Return Value:    None
 */

void USBD_WakeUpCfg (uint32_t cfg) {
  // Not needed
}


/*
 *  USB Device Set Address Function
 *    Parameters:      adr:   USB Device Address
 *    Return Value:    None
 */

void USBD_SetAddress (uint32_t  adr, uint32_t setup) {
  if (setup) {
    USB->DCFG = (USB->DCFG & ~(_USB_DCFG_DEVADDR_MASK)) | (adr << _USB_DCFG_DEVADDR_SHIFT);
  }
}


/*
 *  USB Device Configure Function
 *    Parameters:      cfg:   Device Configure/Deconfigure
 *    Return Value:    None
 */

void USBD_Configure (uint32_t cfg) {
  InPacketDataReady &= ~1UL;
}


/*
 *  Configure USB Device Endpoint according to Descriptor
 *    Parameters:      pEPD:  Pointer to Device Endpoint Descriptor
 *    Return Value:    None
 */

void USBD_ConfigEP (USB_ENDPOINT_DESCRIPTOR *pEPD) {
  uint32_t num, val, type;

  num  = pEPD->bEndpointAddress & ~(0x80);
  val  = pEPD->wMaxPacketSize;
  type = pEPD->bmAttributes & USB_ENDPOINT_TYPE_MASK;
	
	if (num > USBD_MAX_ENDPOINT_NUM) return;

  if (pEPD->bEndpointAddress & USB_ENDPOINT_DIRECTION_MASK) {
    USB->DAINTMSK |= (1    << num);                             // unmask IN EP int
    DIEPCTL(num)   = (num  <<  _USB_DIEP_CTL_TXFNUM_SHIFT) |    // fifo number
                     (type <<  _USB_DIEP_CTL_EPTYPE_SHIFT) |    // ep type
                     (val  &  (_USB_DIEP_CTL_MPS_MASK >> _USB_DIEP_CTL_MPS_SHIFT));         // max packet size
                     
    if ((type & 3) > 1)                                         // if interrupt or bulk EP
      DIEPCTL(num) |= USB_DIEP_CTL_SETD0PIDEF;                  // DATA0 PID
  } else {
    OutMaxPacketSize[num] = val & (_USB_DIEP_CTL_MPS_MASK >> _USB_DIEP_CTL_MPS_SHIFT);

    USB->DAINTMSK |= (1 << (num + 16)); // unmask OUT EP int

    DOEPCTL(num)   = (type <<  _USB_DOEP_CTL_EPTYPE_SHIFT)                        |   // EP type
                     (val &   (_USB_DOEP_CTL_MPS_MASK >> _USB_DOEP_CTL_MPS_SHIFT));   // max packet size
                     
    DOEPTSIZ(num)  = (1 << _USB_DOEP_TSIZ_PKTCNT_SHIFT)                           |   // packet count = 1
                     (val  & (_USB_DOEP_CTL_MPS_MASK >> _USB_DOEP_CTL_MPS_SHIFT));    // transfer size
                     
    if ((type & 3) > 1)                         // if int or bulk EP
      DOEPCTL(num) |= USB_DOEP_CTL_SETD0PIDEF;  // DATA0 PID
  }
}


/*
 *  Set Direction for USB Device Control Endpoint
 *    Parameters:      dir:   Out (dir == 0), In (dir <> 0)
 *    Return Value:    None
 */

void USBD_DirCtrlEP (uint32_t dir) {
  // Not needed
}


/*
 *  Enable USB Device Endpoint
 *    Parameters:      EPNum: Device Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */

void USBD_EnableEP (uint32_t EPNum) {
  if((EPNum & 0x7F) > USBD_MAX_ENDPOINT_NUM) return;
  if (EPNum & 0x80) {
    EPNum &= ~0x80;
    DIEPCTL(EPNum)    |= USB_DIEP_CTL_USBACTEP |  // EP active
                         USB_DIEP_CTL_SNAK;       // set EP NAK
                         
    if (DIEPCTL(EPNum)&  USB_DIEP_CTL_EPENA) {
      DIEPCTL(EPNum)  |= USB_DIEP_CTL_EPDIS;      // disable EP
    }
    
    InPacketDataReady &= ~(1 << EPNum);
    if (EP_IN_TYPE(EPNum) == USB_ENDPOINT_TYPE_ISOCHRONOUS) {
      USB->GINTMSK |= USB_GINTMSK_INCOMPISOINMSK; // enable INCOMPISOIXFR
    }
  } else {
    if (EP_OUT_TYPE(EPNum) == USB_ENDPOINT_TYPE_ISOCHRONOUS) {
      USB->GINTMSK   |= USB_GINTMSK_EOPFMSK;      // enable end of periodic frame
      DOEPCTL(EPNum) |= USB_DOEP_CTL_USBACTEP;    // EP active
    } else {
      DOEPCTL(EPNum)  |= USB_DOEP_CTL_USBACTEP |  // EP active
                         USB_DOEP_CTL_EPENA    |  // enable EP
                         USB_DOEP_CTL_CNAK;       // clear EP NAK
    }
  }
}


/*
 *  Disable USB Endpoint
 *    Parameters:      EPNum: Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */

void USBD_DisableEP (uint32_t EPNum) {
  uint32_t num, wcnt, IsoEpEnCnt;

  IsoEpEnCnt = 0;
	
	if ((EPNum & 0x7F) > USBD_MAX_ENDPOINT_NUM) return;

  // Disable IN Endpoint
  if (EPNum & 0x80) {
    EPNum &= ~0x80;
    for (num = 1; num <= USBD_EP_NUM; num++) {
      if (DIEPCTL(num) & USB_DIEP_CTL_USBACTEP) {
        if (EP_IN_TYPE(num) == USB_ENDPOINT_TYPE_ISOCHRONOUS) {
          IsoEpEnCnt++;
        }
      }
    }

    InPacketDataReady &= ~(1 << EPNum);
    if (IsoEpEnCnt == 1) {                          // if all iso endpoints disabled
      USB->GINTMSK &= ~USB_GINTMSK_INCOMPISOINMSK;  // disable INCOMPISOIXFR
    }
    
    if (DIEPCTL(EPNum) &   USB_DIEP_CTL_EPENA) {    // if already enabled
      DIEPCTL(EPNum)   |=  USB_DIEP_CTL_EPDIS;      // disable EP
    }
    
    DIEPCTL(EPNum)     |=  USB_DIEP_CTL_SNAK;       // set EP NAK
    DIEPCTL(EPNum)     &= ~USB_DIEP_CTL_USBACTEP;   // deactivate EP
    
  // Disable OUT Endpoint
  } else {
    for (num = 1; num <= USBD_EP_NUM; num++) {
      if (DOEPCTL(num) & USB_DOEP_CTL_USBACTEP) {
        if (EP_OUT_TYPE(num) == USB_ENDPOINT_TYPE_ISOCHRONOUS) {
          IsoEpEnCnt++;
        }
      }
    }
    if (IsoEpEnCnt == 1)                            // if all iso endpoints disabled
      USB->GINTMSK &= ~USB_GINTMSK_EOPFMSK;         // disable EOPF
    
    USB->DCTL |= USB_DCTL_SGOUTNAK;                 // set global out nak

    wcnt = 1000;
    while (!(USB->GINTSTS & USB_GINTSTS_GOUTNAKEFF))  // wait until global NAK
      if ((wcnt--) == 0) break;
    
    if (DOEPCTL(EPNum) &   USB_DOEP_CTL_EPENA) {    // if ep enabled
      DOEPCTL(EPNum)   |=  USB_DOEP_CTL_EPDIS;      // disable EP
    }
    
    DOEPCTL(EPNum)     |=  USB_DOEP_CTL_SNAK;       // set EP NAK
    DOEPCTL(EPNum)     &= ~USB_DOEP_CTL_USBACTEP;   // deactivate EP

