stevew817/DAPLink/source/common/hal/siliconlabs/efm32hg/usbd_EFM32HG.c
    // wait until EP disabled
    wcnt = 1000;
    while(!(DOEPINT(EPNum) & USB_DOEP_INT_EPDISBLD)) { 
      if ((wcnt--) == 0) {
        break;
      }
    }
    USB->DCTL |= USB_DCTL_CGOUTNAK;                 // clear global nak
  }
}


/*
 *  Reset USB Device Endpoint
 *    Parameters:      EPNum: Device Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */

void USBD_ResetEP (uint32_t EPNum) {

	if ((EPNum & 0x7F) > USBD_MAX_ENDPOINT_NUM) return;
	
  // Reset IN Endpoint
  if (EPNum & 0x80) {
    EPNum &= ~0x80;
    InPacketDataReady &= ~(1 << EPNum);
    if (DIEPCTL(EPNum) &  USB_DIEP_CTL_EPENA) {// if Endpoint enabled
      DIEPCTL(EPNum)   |= USB_DIEP_CTL_EPDIS;  // disable EP
    }
    DIEPCTL(EPNum)     |= USB_DIEP_CTL_SNAK;  // set EP NAK

    USBD_FlushInEpFifo (EPNum | 0x80);  // Flush endpoint fifo

    // If endpoint is isochronous, set proper EVEN/ODD frame and enable Ep
    if (EP_IN_TYPE(EPNum) == USB_ENDPOINT_TYPE_ISOCHRONOUS) {
      if (USBD_GetFrame() & 1) {
        DIEPCTL(EPNum) |= USB_DIEP_CTL_SETD0PIDEF;  // set even frame
      } else {
        DIEPCTL(EPNum) |= USB_DIEP_CTL_SETD1PIDOF;  // set odd frame
      }
      DIEPCTL(EPNum)  |= USB_DIEP_CTL_EPENA | USB_DIEP_CTL_CNAK; // enable EP
    }
  }
}


/*
 *  Set Stall for USB Device Endpoint
 *    Parameters:      EPNum: Device Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */

void USBD_SetStallEP (uint32_t EPNum) {
  uint32_t wcnt;
	
	if ((EPNum & 0x7F) > USBD_MAX_ENDPOINT_NUM) return;
  
  // Stall OUT Endpoint
  if (!(EPNum & 0x80)) {
    USB->DCTL |= USB_DCTL_SGOUTNAK;                   // set global out nak
    wcnt = 1000;
    while (!(USB->GINTSTS & USB_GINTSTS_GOUTNAKEFF))  // wait until global NAK
      if ((wcnt--) == 0) break;
    
    if (DOEPCTL(EPNum) &  USB_DOEP_CTL_EPENA)         // if endpoint enabled
      DOEPCTL(EPNum)   |= USB_DOEP_CTL_EPDIS;         // disable EP
    DOEPCTL(EPNum)     |= USB_DOEP_CTL_STALL;         // set stall
    
    wcnt = 1000;
    while(!(DOEPINT(EPNum) & USB_DOEP_INT_EPDISBLD))  // wait until EP disabled
      if ((wcnt--) == 0) break;
      
    USB->DCTL |= USB_DCTL_CGOUTNAK;                   // clear global nak

  // Stall IN endpoint
  } else {
    EPNum &= ~0x80;
    if (DIEPCTL(EPNum) &  USB_DIEP_CTL_EPENA)         // if endpoint enabled
      DIEPCTL(EPNum)   |= USB_DIEP_CTL_EPDIS;         // disable endpoint
    DIEPCTL(EPNum)     |= USB_DIEP_CTL_STALL;         // set stall

    USBD_FlushInEpFifo (EPNum | 0x80);                // Flush endpoint fifo
  }
}


/*
 *  Clear Stall for USB Device Endpoint
 *    Parameters:      EPNum: Device Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */

void USBD_ClrStallEP (uint32_t EPNum) {
	if ((EPNum & 0xF) > USBD_MAX_ENDPOINT_NUM) return;
  // Clear OUT endpoint Stall
  if (!(EPNum & 0x80)) {

    if (((DOEPCTL(EPNum) >> _USB_DOEP_CTL_EPTYPE_SHIFT) & 3) > 1) { // if EP type Bulk or Interrupt
      DOEPCTL(EPNum) |= USB_DOEP_CTL_SETD0PIDEF;  // Set DATA0 PID

    DOEPCTL(EPNum) &= ~USB_DOEP_CTL_STALL;        // Clear stall
  }
 
  // Clear IN Endpoint Stall
  } else {
    EPNum &= ~0x80;

    if (DIEPCTL(EPNum) &  USB_DIEP_CTL_EPENA)     // if endpoint enabled
      DIEPCTL(EPNum)   |= USB_DIEP_CTL_EPDIS;     // disable endpoint

    USBD_FlushInEpFifo (EPNum | 0x80);            // Flush endpoint fifo

    if (((DIEPCTL(EPNum) >> _USB_DIEP_CTL_EPTYPE_SHIFT) & 3) > 1)// if Interrupt or bulk EP
      DIEPCTL(EPNum) |= USB_DIEP_CTL_SETD0PIDEF;  // Set DATA0 PID

    DIEPCTL(EPNum) &= ~USB_DOEP_CTL_STALL;        // clear Stall
  }
}


/*
 *  Clear USB Device Endpoint Buffer
 *    Parameters:      EPNum: Device Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */

void USBD_ClearEPBuf (uint32_t EPNum) {
	if ((EPNum & 0xF) > USBD_MAX_ENDPOINT_NUM) return;
  if (EPNum & 0x80) {
    USBD_FlushInEpFifo (EPNum | 0x80);
  } else {
    USB->GRSTCTL |= USB_GRSTCTL_RXFFLSH;
    generic_delay(2);
  }
}


/*
 *  Read USB Device Endpoint Data
 *    Parameters:      EPNum: Device Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *                     pData: Pointer to Data Buffer
 *    Return Value:    Number of bytes read
 */

uint32_t USBD_ReadEP (uint32_t EPNum, uint8_t *pData) {
  uint32_t i, sz, isoEpFlag;
	
	EPNum &= 0xF;
	if ((EPNum & 0xF) > USBD_MAX_ENDPOINT_NUM) return 0;

  if ((DOEPCTL(EPNum) & USB_DOEP_CTL_USBACTEP) == 0) return (0); // if Ep not active
  isoEpFlag = (EP_OUT_TYPE(EPNum) == USB_ENDPOINT_TYPE_ISOCHRONOUS);
  
  // Isochronous Ep: read data from intermediate buffer
  if (isoEpFlag) {                      // if Isochronouos endpoint
    if (IsoOutTokenRead == 0) {          
      sz = IsoOutPacketDataCnt[EPNum];  // get data size
      for (i = 0; i < sz; i++) {        // copy data from intermediate buffer
        pData[i] = ((uint8_t *)(IsoOutPacketDataPtr[EPNum]))[i];
      }
      IsoOutPacketDataCnt[EPNum] = 0;   // reset data count
      return (sz);
    }
  }
  
  sz = (( USB->GRXSTSP & _USB_GRXSTSP_BCNT_MASK) >> _USB_GRXSTSP_BCNT_SHIFT);    // get available data size
   if (isoEpFlag) {
    // if data pid = data0 and 
    //   number of packets in which this payload was received = 1, data is valid
    if ((DOEPTSIZ(EPNum) & (_USB_DOEP_TSIZ_PKTCNT_MASK | USB_DOEP_TSIZ_RXDPIDSUPCNT_MDATA)) == 0)  
      IsoOutPacketDataCnt[EPNum] = sz;  // save isochronous Ep data size
    else IsoOutPacketDataCnt[EPNum] = 0;// else data is unvalid
  }

  // copy data from fifo
  //  if Isochronous Ep: data is copied to intermediate buffer
  for (i = 0; i < (uint32_t)((sz+3)/4); i++) {
    *((__packed uint32_t *)pData) = RX_FIFO;
    pData += 4;
  }
  // wait RxFIFO non-empty (OUT transfer completed or Setup trans. completed)
  while ((USB->GINTSTS & USB_GINTSTS_RXFLVL) == 0);  
  USB->GRXSTSP;                         // pop register
  USB->GINTMSK |= USB_GINTMSK_RXFLVLMSK;// unmask RxFIFO non-empty interrupt

  return (sz);
}


