stevew817/DAPLink/source/common/hal/siliconlabs/efm32hg/usbd_EFM32HG.c
/*
 *  Write USB Device Endpoint Data
 *  If write was requested synchronously from IRQ then data is written to FIFO directly 
 *  else data is written to the intermediate buffer and synchronously transferred to FIFO 
 *  on next NAK event.
 *    Parameters:      EPNum: Device Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *                     pData: Pointer to Data Buffer
 *                     cnt:   Number of bytes to write
 *    Return Value:    Number of bytes written
 */

uint32_t USBD_WriteEP (uint32_t EPNum, uint8_t *pData, uint32_t cnt) {
  uint32_t *ptr, i, isoEpFlag;

  EPNum &= ~(0x80);
	if ((EPNum & 0xF) > USBD_MAX_ENDPOINT_NUM) return cnt;

  if ((DIEPCTL(EPNum) & USB_DIEP_CTL_USBACTEP) == 0) return (0); // if Ep not active
	
  isoEpFlag = (EP_IN_TYPE(EPNum) == USB_ENDPOINT_TYPE_ISOCHRONOUS);

  // Asynchronous write to intermediate buffer
  if (!SyncWriteEP && InPacketDataPtr[EPNum]) {
    if ((!(InPacketDataReady & (1 << EPNum))) || isoEpFlag) {
      InPacketDataCnt[EPNum] = cnt;     // save Data size
      ptr = InPacketDataPtr[EPNum];
      i   = (cnt+3)/4;
      if (i) { 
        while (i--) {                   // save data to intermediate buffer
          *ptr++ = *((__packed uint32_t *)pData);
          pData +=4;
        }
      }
      if (!isoEpFlag) {
        InPacketDataReady |=  1 << EPNum;
        DIEPCTL(EPNum)    |= USB_DIEP_CTL_SNAK;         // Set NAK to enable interrupt on NAK
        USB->DIEPMSK      |= USB_DIEPMSK_INEPNAKEFFMSK; // INEPNEM = 1, IN EP NAK efective msk
      }
    } else {                            // If packet already loaded to buffer
      return 0;
    }
  } else {
    if (cnt) while ((DTXFSTS(EPNum) * 4) < cnt); // get space in Ep TxFIFO
		// Make FIFO filling an atomic task
		INT_Disable();

    // Set transfer size and packet count
    DIEPTSIZ(EPNum) = cnt                                 | 
                      (1 << _USB_DIEP_TSIZ_PKTCNT_SHIFT)  | 
                      (1 << _USB_DIEP_TSIZ_MC_SHIFT); 
                             
    if (isoEpFlag) { // if Isochronous Ep: set packet frame
      if (USBD_GetFrame() & 1) DIEPCTL(EPNum) |= USB_DIEP_CTL_SETD0PIDEF; // even frame
      else                     DIEPCTL(EPNum) |= USB_DIEP_CTL_SETD1PIDOF; // odd frame
    }
    
    DIEPCTL(EPNum) |= USB_DIEP_CTL_EPENA | USB_DIEP_CTL_CNAK;  // enable ep and clear NAK
    if (cnt) {
      ptr = (uint32_t *)pData;
      i   = (cnt+3)/4;
      while (i--) {                     
        // Copy data to endpoint TxFIFO
        TX_FIFO(EPNum) = *(__packed uint32_t *)pData;
        pData +=4;
      }
    }
    if (isoEpFlag == 0) InPacketDataReady &= ~(1 << EPNum);
		
		// End of atomic block
		INT_Enable();
  }
  return (cnt);
}


/*
 *  Get USB Device Last Frame Number
 *    Parameters:      None
 *    Return Value:    Frame Number
 */

uint32_t USBD_GetFrame (void) {
  return ((USB->DSTS & _USB_DSTS_SOFFN_MASK) >> _USB_DSTS_SOFFN_SHIFT);
}


/*
 *  USB Device Interrupt Service Routine
 */
void USB_IRQHandler(void) {
  uint32_t istr, val, num, i, msk;
  static uint32_t IsoInIncomplete = 0;

  istr = USB->GINTSTS & USB->GINTMSK;

// reset interrupt
  if ((istr & USB_GINTSTS_USBRST) != 0U) {
    USBD_Reset();
    usbd_reset_core();
#ifdef __RTX
    if (USBD_RTX_DevTask) {
      isr_evt_set(USBD_EVT_RESET, USBD_RTX_DevTask);
    }
#else
    if (USBD_P_Reset_Event) {
      USBD_P_Reset_Event();
    }
#endif
    USB->GINTSTS = USB_GINTSTS_USBRST;
  }

// suspend interrupt
  if ((istr & USB_GINTSTS_USBSUSP) != 0U) {
    USBD_Suspend();
#ifdef __RTX
    if (USBD_RTX_DevTask) {
      isr_evt_set(USBD_EVT_SUSPEND, USBD_RTX_DevTask);
    }
#else
    if (USBD_P_Suspend_Event) {
      USBD_P_Suspend_Event();
    }
#endif
    USB->GINTSTS = USB_GINTSTS_USBSUSP;
  }

// resume interrupt
  if ((istr & USB_GINTSTS_WKUPINT) != 0U) {
    USBD_Resume();
#ifdef __RTX
    if (USBD_RTX_DevTask) {
      isr_evt_set(USBD_EVT_RESUME, USBD_RTX_DevTask);
    }
#else
    if (USBD_P_Resume_Event) {
      USBD_P_Resume_Event();
    }
#endif
    USB->GINTSTS = USB_GINTSTS_WKUPINT;
  }

// speed enumeration completed
  if ((istr & USB_GINTSTS_ENUMDONE) != 0U) {
    USB->DIEP0CTL &= ~(_USB_DIEP0CTL_MPS_MASK << _USB_DIEP0CTL_MPS_SHIFT);
    switch (USBD_MAX_PACKET0) {
      case 8:
        USB->DIEP0CTL |= USB_DIEP0CTL_MPS_8B;
      break;

      case 16:
        USB->DIEP0CTL |= USB_DIEP0CTL_MPS_16B;
      break;

      case 32:
        USB->DIEP0CTL |= USB_DIEP0CTL_MPS_32B;
      break;
			default:
				break;
    }
    USB->DCTL    |= USB_DCTL_CGNPINNAK;     // clear global IN NAK
    USB->DCTL    |= USB_DCTL_CGOUTNAK;      // clear global OUT NAK
    USB->GINTSTS  = USB_GINTSTS_ENUMDONE;
  }

// Start Of Frame
  if (istr & USB_GINTSTS_SOF) {
#ifdef __RTX
    if (USBD_RTX_DevTask) {
      isr_evt_set(USBD_EVT_SOF, USBD_RTX_DevTask);
    }
#else
    if (USBD_P_SOF_Event) {
      USBD_P_SOF_Event();
    }
#endif
     USB->GINTSTS = USB_GINTSTS_SOF;
  }

// RxFIFO non-empty
  if ((istr & USB_GINTSTS_RXFLVL) != 0U) {
    val = USB->GRXSTSR;
    num = val & _USB_GRXSTSR_CHEPNUM_MASK;

    switch ((val & _USB_GRXSTSR_PKTSTS_MASK) >> _USB_GRXSTSR_PKTSTS_SHIFT) {
// setup packet
      case _USB_GRXSTSR_PKTSTS_SETUPRCV:
#ifdef __RTX
      USB->GINTMSK &= ~USB_GINTMSK_RXFLVLMSK;
      if (USBD_RTX_EPTask[num]) {
        isr_evt_set(USBD_EVT_SETUP, USBD_RTX_EPTask[num]);
      }
#else
      if (USBD_P_EP[num]) {
        USBD_P_EP[num](USBD_EVT_SETUP);
      }
#endif
      break;

// OUT packet
      case _USB_GRXSTSR_PKTSTS_PKTRCV:
      USB->GINTMSK &= ~USB_GINTMSK_RXFLVLMSK;
      if (EP_OUT_TYPE(num) == USB_ENDPOINT_TYPE_ISOCHRONOUS) {
        IsoOutTokenRead = 1;
        USBD_ReadEP (num, (uint8_t *)IsoOutPacketDataPtr[num]);
        IsoOutTokenRead = 0;
      } else {
#ifdef __RTX
        if (USBD_RTX_EPTask[num]) {
          isr_evt_set(USBD_EVT_OUT, USBD_RTX_EPTask[num]);
        }
#else
        if (USBD_P_EP[num]) {
          USBD_P_EP[num](USBD_EVT_OUT);
        }
#endif
      }
      break;

      default:
        USB->GRXSTSP;
    }
  }

// OUT Packet
  if ((istr & USB_GINTSTS_OEPINT) != 0U) {
    msk = (((USB->DAINT & USB->DAINTMSK) >> 16) & 0xFFFF);
    i   = 0;
    while (msk) {
      num = 0;
      for (; i < (USBD_EP_NUM+1); i++) {
        if ((msk >> i) & 1) {
          num = i;
          msk &= ~(1 << i);
          break;
        }
      }

      // Endpoint disabled
      if (DOEPINT(num) & USB_DOEP_INT_EPDISBLD) {
        if (EP_OUT_TYPE(num) == USB_ENDPOINT_TYPE_ISOCHRONOUS) {
          DOEPTSIZ(num) = (1 << 19) |                // packet count
                          (OutMaxPacketSize[num]);   // transfer size
          
          if ((USBD_GetFrame() & 1)) DOEPCTL(num) |= USB_DOEP_CTL_SETD0PIDEF; // even frame
          else                       DOEPCTL(num) |= USB_DOEP_CTL_SETD1PIDOF; // odd frame

          DOEPCTL(num)    |= USB_DOEP_CTL_EPENA | USB_DOEP_CTL_CNAK;
        }
        DOEPINT(num) |= USB_DOEP_INT_EPDISBLD;
      }
      
      // Transfer complete interrupt
      if ((DOEPINT(num) & USB_DOEP_INT_XFERCOMPL) | (DOEPINT(num) & USB_DOEP_INT_SETUP)) {
        if (EP_OUT_TYPE(num) != USB_ENDPOINT_TYPE_ISOCHRONOUS) {

          DOEPTSIZ(num)    = (1 << _USB_DOEP_TSIZ_PKTCNT_SHIFT) | // packet count
                             (OutMaxPacketSize[num]);             // transfer size
          if (num == 0) {
            DOEPTSIZ(0)   |= (1 << _USB_DOEP_TSIZ_RXDPIDSUPCNT_SHIFT);
          }
          
          //Enable endpoint, clear NAK
          DOEPCTL(num)    |= USB_DOEP_CTL_EPENA | USB_DOEP_CTL_CNAK;
        }
        DOEPINT(num) |= USB_DOEP_INT_XFERCOMPL;
      }
    }
  }

// IN Packet
  if (istr & USB_GINTSTS_IEPINT) {
    msk = (USB->DAINT & USB->DAINTMSK & 0xFFFF);
    i   = 0;
    while (msk) {
      num = 0;
      for (; i < (USBD_EP_NUM+1); i++) {
        if ((msk >> i) & 1) {
          num = i;
          msk &= ~(1 << i);
          break;
        }
      }

      // Endpoint disabled
      if (DIEPINT(num) & USB_DIEP_INT_EPDISBLD) {
        DIEPINT(num) = USB_DIEP_INT_EPDISBLD;
        
        if (EP_IN_TYPE(num) == USB_ENDPOINT_TYPE_ISOCHRONOUS) {
          if ((IsoInIncomplete & (1 << num)) != 0) {

