stevew817/DAPLink/source/common/hal/siliconlabs/efm32hg/usbd_EFM32HG.c
            USBD_FlushInEpFifo(num | 0x80);
            SyncWriteEP = 1;
            USBD_WriteEP (num, (uint8_t *)InPacketDataPtr[num], InPacketDataCnt[num]);
            SyncWriteEP = 0;

            IsoInIncomplete &= ~(1 << num);
          }
        }
      }

      // IN endpoint NAK effective
      if (DIEPINT(num) & USB_DIEP_INT_INEPNAKEFF) {
        if (EP_IN_TYPE(num) != USB_ENDPOINT_TYPE_ISOCHRONOUS) {
          if (InPacketDataPtr[num] && (InPacketDataReady & (1 << num))) {
            SyncWriteEP = 1;
            USBD_WriteEP (num, (uint8_t *)InPacketDataPtr[num], InPacketDataCnt[num]);
            SyncWriteEP = 0;
            if (!InPacketDataReady)                       // No more pending IN transfers
              USB->DIEPMSK &= ~USB_DIEPMSK_INEPNAKEFFMSK; // Disable IN NAK interrupts
            continue;
          } else 
              DIEPCTL(num) |= USB_DIEP_CTL_CNAK;          //clear NAK for endpoint
            DIEPINT(num)    = USB_DIEP_INT_INEPNAKEFF;    //clear NAK interrupt bit
        }
      }

      // Transmit completed
      if (DIEPINT(num) & USB_DIEP_INT_XFERCOMPL) {
        DIEPINT(num) = USB_DIEP_INT_XFERCOMPL;
        SyncWriteEP = 1;
        if (EP_IN_TYPE(num) == USB_ENDPOINT_TYPE_ISOCHRONOUS) {
          USBD_WriteEP (num, (uint8_t *)InPacketDataPtr[num], InPacketDataCnt[num]);
        } else {
#ifdef __RTX
          if (USBD_RTX_EPTask[num]) {
            isr_evt_set(USBD_EVT_IN,  USBD_RTX_EPTask[num]);
          }
#else
          if (USBD_P_EP[num]) {
            USBD_P_EP[num](USBD_EVT_IN);
          }
#endif
        }
        SyncWriteEP = 0;
      }
    }
  }

// End of periodic frame
  if (istr & USB_GINTSTS_EOPF) {
    for (num = 1; num <= USBD_EP_NUM; num++) {

      if (EP_OUT_TYPE(num) != USB_ENDPOINT_TYPE_ISOCHRONOUS) continue;
      if (((DOEPCTL(num) >> 15) & 1) == 0)                   continue;

      // incomplete isochronous out transfer
      if (USB->GINTSTS & USB_GINTSTS_INCOMPLP) {
        if ((USBD_GetFrame() & 1) == ((DOEPCTL(num) >> 16) & 1)) {
          if (DOEPCTL(num) & USB_DOEP_CTL_EPENA) {
            InPacketDataCnt[num] = 0;             // discard data
            DOEPCTL(num) |= USB_DOEP_CTL_EPDIS;   // disable endpoint
          }
        }

      // prepare for next isohronous transfer
      } else {
        DOEPTSIZ(num) = (1 << _USB_DOEP_TSIZ_PKTCNT_SHIFT) |  // packet count
                        (OutMaxPacketSize[num]);              // transfer size

        if ((USBD_GetFrame() & 1)) {
          DOEPCTL(num) |= USB_DOEP_CTL_SETD0PIDEF; // even frame
        } else {
          DOEPCTL(num) |= USB_DOEP_CTL_SETD1PIDOF; // odd frame
        }

        DOEPCTL(num)    |= USB_DOEP_CTL_EPENA | USB_DOEP_CTL_CNAK;
      }
    }
    USB->GINTSTS = USB_GINTSTS_EOPF | USB_GINTSTS_INCOMPLP;
  }

// incomplete isochronous IN transfer
  if (istr & USB_GINTSTS_INCOMPISOIN) {
    USB->GINTSTS = USB_GINTSTS_INCOMPISOIN;
    for (num = 1; num < (USBD_EP_NUM + 1); num++) {

      if (EP_IN_TYPE(num) != USB_ENDPOINT_TYPE_ISOCHRONOUS) continue;
      if (((DIEPCTL(num) >> 15) & 1) == 0)                  continue;

      if (DIEPCTL(num) & USB_DIEP_CTL_EPENA) { // if EP en & packet frame is incorect
        if ((USBD_GetFrame() & 1) == ((DIEPCTL(num) >> 16) & 1)) {
          
          IsoInIncomplete |= (1 << num);
          DIEPCTL(num)    |= USB_DIEP_CTL_EPDIS | USB_DIEP_CTL_SNAK;
        }
      }
    }
  }
}
